# Azimuth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..Azimuth Property
ParameterTypeId Class See Also
---
"Azimuth"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId Azimuth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Azimuth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Azimuth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace